# language: ru

@tree
@classname=ModuleExceptionPath

Функционал: HTTPStatusCodes.Tests.Tests_КодОтветаHTTPКлиент
	Как Разработчик
	Я Хочу чтобы возвращаемое значение метода совпадало с эталонным
	Чтобы я мог гарантировать работоспособность метода

Сценарий: Тест_НайтиКодПоИдентификатору
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_НайтиКодПоИдентификатору(Контекст());' |

Сценарий: Тест_НайтиИдентификаторПоКоду
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_НайтиИдентификаторПоКоду(Контекст());' |

Сценарий: Тест_НайтиОписаниеПоИдентификатору
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_НайтиОписаниеПоИдентификатору(Контекст());' |

Сценарий: Тест_КлассКодаОтвета
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_КлассКодаОтвета(Контекст());' |

Сценарий: Тест_is1xxInformational
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_is1xxInformational(Контекст());' |

Сценарий: Тест_is2xxSuccessful
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_is2xxSuccessful(Контекст());' |

Сценарий: Тест_is3xxRedirection
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_is3xxRedirection(Контекст());' |

Сценарий: Тест_is4xxClientError
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_is4xxClientError(Контекст());' |

Сценарий: Тест_is5xxServerError
	И я выполняю код встроенного языка
	| 'Tests_КодОтветаHTTPКлиент.Тест_is5xxServerError(Контекст());' |